Repository: alielsokary/CaskHub
Catalog: CaskHub/Resources/Localizable.xcstrings
Source language: en
Languages: uk, zh_hans

source: (older)
uk: (старіша)

source: %@ pours
uk: %@ встановлень
zh_hans: %@ 次下载

source: %@ theme
uk: Тема: %@
zh_hans: %@ 主题

source: %lld casks
uk: %lld пакета Cask
zh_hans: %lld 个 Cask

source: %lld Days
uk: %lld дн.
zh_hans: %lld 天

source: %lld operations in progress
uk: Операцій виконується: %lld
zh_hans: %lld 项操作进行中

source: `%@` failed (exit %d): %@
uk: Не вдалося виконати `%@` (код завершення %d): %@
zh_hans: `%@` 执行失败（退出码 %d）：%@

source: `%@` failed (exit %d).
uk: Не вдалося виконати `%@` (код завершення %d).
zh_hans: `%@` 执行失败（退出码 %d）。

# alert.uninstall.zap
source: This also removes preferences, caches, and support files listed by the cask, including any shared files. This will run:
uk: Також буде видалено налаштування, кеші та допоміжні файли, зазначені в Cask, зокрема спільні файли. Буде виконано:
zh_hans: 这也会移除 Cask 中列出的偏好设置、缓存和支持文件，包括共享文件。将执行：

# settings.uninstall.description
source: Uses Homebrew’s --zap to remove preferences, caches, and support files listed by the cask.
uk: Використовує параметр --zap у Homebrew для видалення налаштувань, кешів і допоміжних файлів, зазначених у Cask.
zh_hans: 使用 Homebrew 的 --zap 移除 Cask 中列出的偏好设置、缓存和支持文件。

# settings.uninstall.removeAppData
source: Remove app data on uninstall
uk: Видаляти дані програми під час її видалення
zh_hans: 卸载时移除应用数据

# settings.uninstall.title
source: Uninstall
uk: Видалення
zh_hans: 卸载

source: ✷ HOUSE PICK
uk: ✷ ВИБІР РЕДАКЦІЇ
zh_hans: ✷ 编辑精选

source: 30 Days
uk: 30 днів
zh_hans: 30 天

source: 90 Days
uk: 90 днів
zh_hans: 90 天

source: About
uk: Про програму
zh_hans: 关于

source: About CaskHub
uk: Про CaskHub

# action.cleanup.zombieHelp
source: %@ was removed outside Homebrew, but Homebrew still has records for it. Clean Up removes the leftover data.
uk: %@ було видалено поза Homebrew, але Homebrew досі зберігає записи про програму. «Очистити» видалить залишкові дані.
zh_hans: %@ 已在 Homebrew 之外被移除，但 Homebrew 仍保留着它的记录。「清理」会删除残留数据。

source: Adopt
uk: Додати під керування
zh_hans: 接管

source: Adopt %@?
uk: Додати %@ під керування?
zh_hans: 接管 %@？

source: Adopt Anyway
uk: Усе одно додати під керування
zh_hans: 仍要接管

source: Adopt Apps
uk: Додати програми під керування
zh_hans: 接管应用

source: Adopt Apps lists installed apps that Homebrew can start managing for you.
uk: Тут перелічено встановлені програми, які можна додати під керування Homebrew.
zh_hans: 「接管应用」会列出 Homebrew 可以开始为你管理的已安装应用。

source: Adopt this app first so CaskHub can manage/uninstall it.
uk: Спочатку додайте цю програму під керування, щоб CaskHub міг керувати нею та видаляти її.
zh_hans: 请先接管此应用，CaskHub 才能管理或卸载它。

source: Adopting Apps
uk: Додавання програм під керування
zh_hans: 接管应用

source: Adopting…
uk: Додавання під керування…
zh_hans: 正在接管…

# alert.adopt.button
source: Adopt
uk: Додати під керування
zh_hans: 接管

# alert.adopt.downgradeButton
source: Downgrade & Adopt
uk: Понизити версію й додати під керування
zh_hans: 降级并接管

# alert.adopt.downgradeTitle
source: Downgrade & Adopt %@?
uk: Понизити версію й додати %@ під керування?
zh_hans: 降级并接管 %@？

# alert.adopt.existingApplication
source: Homebrew will adopt the existing %@ app without replacing it.
uk: Homebrew додасть наявну програму %@ під своє керування без заміни.
zh_hans: Homebrew 将接管现有的 %@ 应用，而不会替换它。

# alert.adopt.packageInstaller
source: This app uses a package installer, so Homebrew must run the installer again to create its management record. macOS may ask for an administrator password.
uk: Ця програма використовує інсталятор пакетів, тому Homebrew має знову запустити його, щоб створити запис керування. macOS може запитати пароль адміністратора.
zh_hans: 此应用使用软件包安装器，因此 Homebrew 必须再次运行安装器来创建管理记录。macOS 可能会要求输入管理员密码。

# alert.adopt.replaceApplication
source: Homebrew will replace the current %@ app bundle with version %@, then manage future updates.
uk: Homebrew замінить поточний пакет програми %@ версією %@, а потім керуватиме майбутніми оновленнями.
zh_hans: Homebrew 将把当前的 %@ 应用替换为 %@ 版本，之后由 Homebrew 管理后续更新。

# alert.adopt.replacePackage
source: Package installers cannot be adopted as metadata in this situation without reinstalling them. CaskHub will download the Homebrew package first, run the cask's forced uninstall steps, then install it. The app will be unavailable if the final installer fails.
uk: У цій ситуації інсталятор пакетів неможливо додати до записів керування без повторного встановлення. CaskHub спочатку завантажить пакет Homebrew, виконає кроки примусового видалення пакета Cask, а потім встановить його. Якщо останній етап встановлення завершиться помилкою, програма буде недоступна.
zh_hans: 在这种情况下，无法仅通过接管元数据来管理软件包安装器，必须重新安装。CaskHub 会先下载 Homebrew 软件包，运行 cask 的强制卸载步骤，然后进行安装。如果最终安装失败，该应用将不可用。

# alert.adopt.title
source: Adopt %@?
uk: Додати %@ під керування?
zh_hans: 接管 %@？

# alert.adopt.updateButton
source: Update & Adopt
uk: Оновити й додати під керування
zh_hans: 更新并接管

# alert.adopt.updateTitle
source: Update & Adopt %@?
uk: Оновити й додати %@ під керування?
zh_hans: 更新并接管 %@？

# alert.appManagementNeeded
source: macOS only lets CaskHub modify other apps once you grant it the App Management permission, and adopting %@ may need to do that. Enable CaskHub under System Settings → Privacy & Security → App Management (a system notification may also offer it), then come back to continue the adoption.
uk: macOS дозволяє CaskHub змінювати інші програми лише після надання дозволу «Керування програмами». Для додавання %@ під керування цей дозвіл може знадобитися. Увімкніть CaskHub у меню «Системні параметри» → «Конфіденційність і безпека» → «Керування програмами» (це також може запропонувати системне сповіщення), а потім поверніться, щоб продовжити.
zh_hans: 只有在你授予「App 管理」权限后，macOS 才允许 CaskHub 修改其他应用，而接管 %@ 可能需要该权限。请在「系统设置 → 隐私与安全性 → App 管理」中启用 CaskHub（系统通知也可能直接提供该选项），然后返回 CaskHub 继续接管。

# alert.homebrewMissing
source: CaskHub uses Homebrew to install and manage apps, and it doesn't seem to be installed on this Mac. Install it from brew.sh, then come back. CaskHub will pick it up automatically.
uk: CaskHub використовує Homebrew для встановлення програм і керування ними, але Homebrew, схоже, не встановлено на цьому Mac. Встановіть його з brew.sh і поверніться — CaskHub виявить його автоматично.
zh_hans: CaskHub 依靠 Homebrew 来安装和管理应用，但这台 Mac 上似乎尚未安装。请从 brew.sh 安装后再回来，CaskHub 会自动识别。

# alert.installConflict.title
source: Can't Install %@
uk: Не вдається встановити %@
zh_hans: 无法安装 %@

# alert.quitDuringOperation
source: A Homebrew operation is still in progress. Quitting while Homebrew is working may leave the affected app in an incomplete state.
uk: Операція Homebrew ще триває. Якщо завершити CaskHub під час роботи Homebrew, відповідна програма може залишитися в незавершеному стані.
zh_hans: Homebrew 操作仍在进行中。此时退出可能会让相关应用处于不完整状态。

# alert.updateAll.confirmation
source: CaskHub will update all %lld apps currently listed on the Updates page using Homebrew.
uk: CaskHub за допомогою Homebrew оновить усі програми зі сторінки «Оновлення» (усього %lld).
zh_hans: CaskHub 将使用 Homebrew 更新「更新」页面上当前列出的全部 %lld 个应用。

source: Allow
uk: Дозволити
zh_hans: 允许

source: Also list apps that update themselves (brew upgrade --greedy)
uk: Також перелічіть програми, які оновлюються самостійно (brew upgrade --greedy)
zh_hans: 同时列出会自我更新的应用（brew upgrade --greedy）

source: App Management
uk: Керування програмами
zh_hans: App 管理

source: App Management Permission
uk: Дозвіл «Керування програмами»
zh_hans: App 管理权限

source: App Theme
uk: Тема програми
zh_hans: 应用主题

source: Appearance
uk: Зовнішній вигляд
zh_hans: 外观

source: Architecture
uk: Архітектура
zh_hans: 架构

source: Auto Updates
uk: Автоматичні оновлення
zh_hans: 自动更新

source: Automatic Updates
uk: Автоматичні оновлення

source: Automatically check for updates
uk: Автоматично перевіряти наявність оновлень
zh_hans: 自动检查更新

source: Browse
uk: Огляд
zh_hans: 浏览

source: Browse Apps
uk: Огляд програм

source: Bundle Created
uk: Пакет створено
zh_hans: Bundle 创建时间

source: Bundle Modified
uk: Пакет змінено
zh_hans: Bundle 修改时间

source: Bundle Short Version
uk: Коротка версія пакета
zh_hans: Bundle 短版本

source: Bundle Version
uk: Версія пакета
zh_hans: Bundle 版本

source: Cancel
uk: Скасувати
zh_hans: 取消

source: Cancel operation
uk: Скасувати операцію
zh_hans: 取消操作

source: Canceling
uk: Скасування
zh_hans: 正在取消

source: Canceling…
uk: Скасування…
zh_hans: 正在取消…

# cask.action.installed
source: Installed
uk: Встановлено
zh_hans: 已安装

# cask.dateLabel.installed
source: Installed
uk: Встановлено
zh_hans: 安装时间

# cask.state.installed
source: Installed
uk: Встановлено
zh_hans: 已安装

source: CaskHub couldn't prepare the administrator password prompt. Restart CaskHub and try again.
uk: CaskHub не вдалося підготувати запит на введення пароля адміністратора. Перезапустіть CaskHub і повторіть спробу.
zh_hans: CaskHub 无法准备管理员密码提示。请重新启动 CaskHub，然后重试。

source: CaskHub Help
uk: Довідка CaskHub

source: CaskHub needs administrator access
uk: CaskHub потребує доступу адміністратора
zh_hans: CaskHub 需要管理员权限

source: CaskHub Website
uk: Веб-сайт CaskHub

source: CATEGORIES
uk: КАТЕГОРІЇ
zh_hans: 分类

# category.ai
source: AI & LLMs
uk: ШІ та LLM
zh_hans: AI 与大模型

# category.audioMusic
source: Audio & Music
uk: Аудіо та музика
zh_hans: 音频与音乐

# category.browsers
source: Browsers
uk: Браузери
zh_hans: 浏览器

# category.cloudStorage
source: Cloud & Storage
uk: Хмара та сховище
zh_hans: 云与存储

# category.communication
source: Communication
uk: Спілкування
zh_hans: 通讯

# category.designGraphics
source: Design & Graphics
uk: Дизайн і графіка
zh_hans: 设计与图形

# category.developerTools
source: Developer Tools
uk: Інструменти розробника
zh_hans: 开发者工具

# category.financeCrypto
source: Finance & Crypto
uk: Фінанси та криптовалюти
zh_hans: 金融与加密货币

# category.games
source: Games
uk: Ігри
zh_hans: 游戏

# category.menuBar
source: Menu Bar
uk: Рядок меню
zh_hans: 菜单栏

# category.officeTools
source: Office Tools
uk: Офісні інструменти
zh_hans: 办公工具

# category.other
source: Other
uk: Інше
zh_hans: 其他

# category.productivity
source: Productivity
uk: Продуктивність
zh_hans: 效率

# category.scienceEducation
source: Science & Education
uk: Наука та освіта
zh_hans: 科学与教育

# category.screensaverWallpaper
source: Screensaver & Wallpaper
uk: Заставка та шпалери
zh_hans: 屏保与壁纸

# category.securityPrivacy
source: Security & Privacy
uk: Безпека та конфіденційність
zh_hans: 安全与隐私

# category.utilities
source: Utilities
uk: Утиліти
zh_hans: 实用工具

# category.videoMedia
source: Video & Media
uk: Відео та медіа
zh_hans: 视频与媒体

source: Check for Updates…
uk: Перевірити оновлення…
zh_hans: 检查更新…

source: Check Homebrew Setup
uk: Перевірити налаштування Homebrew

source: Check Now
uk: Перевірити зараз

source: Checking download
uk: Перевірка завантаження
zh_hans: 检查下载

source: Checking for updates
uk: Перевірка оновлень

source: Checking…
uk: Перевірка…

source: Choose…
uk: Виберіть…
zh_hans: 选择…

source: Clean Up
uk: Очистити
zh_hans: 清理

source: Clear Cache
uk: Очистити кеш
zh_hans: 清除缓存

source: Clear cached app icons
uk: Очистити кеш значків програм
zh_hans: 清除已缓存的应用图标

source: Clear search
uk: Очистити пошук
zh_hans: 清除搜索

source: Copy Command
uk: Копіювати команду

source: Couldn't find an installed app for %@.
uk: Не вдалося знайти встановлену програму для %@.
zh_hans: 找不到 %@ 已安装的应用。

source: Couldn't locate the brew binary. Is Homebrew installed?
uk: Не вдалося знайти двійковий файл brew. Чи встановлено Homebrew?
zh_hans: 找不到 brew 可执行文件。是否已安装 Homebrew？

source: Crash Reports
uk: Звіти про збої

source: Current Status
uk: Поточний статус
zh_hans: 当前状态

source: Currently selected brew path is invalid
uk: Вибраний шлях до brew недійсний
zh_hans: 当前选择的 brew 路径无效

source: Custom brew path
uk: Власний шлях до brew
zh_hans: 自定义 brew 路径

source: Custom Locations
uk: Власні розташування
zh_hans: 自定义位置

source: Dark
uk: Темна
zh_hans: 深色

source: Deprecated
uk: Застаріле
zh_hans: 已弃用

source: Disabled
uk: Вимкнено
zh_hans: 已禁用

source: DISCOVER
uk: ОГЛЯД
zh_hans: 发现

source: Done
uk: Готово
zh_hans: 完成

source: Download Size
uk: Розмір завантаження
zh_hans: 下载大小

source: Downloading
uk: Завантаження
zh_hans: 正在下载

# error.adoptMissingComponent
source: Your installed copy of %@ is missing a component Homebrew's version includes (%@), so it can't be adopted as-is. You can replace it with Homebrew's copy instead — your settings and data are kept.
uk: У встановленій копії %@ немає компонента з версії Homebrew (%@), тому її не можна додати під керування без змін. Натомість можна замінити її копією Homebrew — налаштування та дані буде збережено.
zh_hans: 你已安装的 %@ 缺少 Homebrew 版本包含的组件（%@），因此无法直接接管。你可以改为用 Homebrew 的版本替换它——你的设置和数据会被保留。

# error.adoptVersionMismatch
source: Your installed copy doesn't match the version Homebrew has on record, so it can't be adopted as-is. You can replace it with Homebrew's copy instead — your settings and data are kept.
uk: Встановлена копія не відповідає версії в записах Homebrew, тому її не можна додати під керування без змін. Натомість можна замінити її копією Homebrew — налаштування та дані буде збережено.
zh_hans: 你已安装的版本与 Homebrew 记录的版本不一致，因此无法直接接管。你可以改为用 Homebrew 的版本替换它——你的设置和数据会被保留。

# error.appManagementDenied
source: macOS blocked CaskHub from modifying apps on your Mac. Enable CaskHub under System Settings → Privacy & Security → App Management, then try again.
uk: macOS заборонила CaskHub змінювати програми на вашому Mac. Увімкніть CaskHub у меню «Системні параметри» → «Конфіденційність і безпека» → «Керування програмами» й повторіть спробу.
zh_hans: macOS 阻止了 CaskHub 修改这台 Mac 上的应用。请在「系统设置 → 隐私与安全性 → App 管理」中启用 CaskHub，然后重试。

# error.caskConflict
source: The Homebrew cask “%@” conflicts with the installed cask “%@”. Uninstall “%@” before trying again.
uk: Пакет Homebrew Cask «%@» конфліктує зі встановленим пакетом Cask «%@». Видаліть «%@» перед повторною спробою.
zh_hans: Homebrew Cask“%@”与已安装的 Cask“%@”冲突。请先卸载“%@”，然后重试。

# error.caskConflictUnknown
source: This Homebrew cask conflicts with another installed cask. Uninstall the conflicting cask before trying again.
uk: Цей пакет Homebrew Cask конфліктує з іншим установленим пакетом Cask. Видаліть конфліктний пакет перед повторною спробою.
zh_hans: 此 Homebrew Cask 与另一个已安装的 Cask 冲突。请先卸载冲突的 Cask，然后重试。

# error.checksumMismatch
source: The download doesn't match the checksum Homebrew has on record — the developer likely replaced the release file after it was published. This isn't a problem with your Mac; Homebrew refuses mismatched downloads for security. Try again in a day or two once the cask is updated.
uk: Завантаження не відповідає контрольній сумі в записах Homebrew — імовірно, розробник замінив файл випуску після публікації. Проблема не у вашому Mac: з міркувань безпеки Homebrew відхиляє завантаження з невідповідною контрольною сумою. Спробуйте знову через день або два, коли пакет Cask оновлять.
zh_hans: 下载内容与 Homebrew 记录的校验和不一致——开发者很可能在发布后替换了发行文件。这不是你的 Mac 的问题；出于安全考虑，Homebrew 会拒绝校验和不匹配的下载。请等该 Cask 更新后，过一两天再试。

# error.staleUpgradeRecord
source: A previous update left an old copy of the app inside Homebrew's records, and Homebrew refuses every upgrade until it's cleared. Repair removes the leftover copy and reinstalls the app fresh — your settings and data are kept.
uk: Попереднє оновлення залишило стару копію програми в записах Homebrew, і Homebrew відхилятиме всі оновлення, доки її не буде видалено. Відновлення видалить залишкову копію та перевстановить програму — ваші налаштування й дані буде збережено.
zh_hans: 上一次更新在 Homebrew 的记录中残留了该应用的旧副本，在清除之前 Homebrew 会拒绝所有升级。「修复」会移除残留副本并重新全新安装——你的设置和数据会被保留。

source: External application
uk: Зовнішня програма
zh_hans: 外部应用

source: External executable
uk: Зовнішній виконуваний файл
zh_hans: 外部可执行文件

source: Featured
uk: Рекомендовані
zh_hans: 精选

source: formulae.brew.sh returned HTTP %lld.
uk: formulae.brew.sh повернув HTTP %lld.
zh_hans: formulae.brew.sh 返回 HTTP %lld。

source: General
uk: Загальні
zh_hans: 通用

source: Getting Started
uk: Початок роботи
zh_hans: 快速入门

source: Go to brew.sh
uk: Перейти на brew.sh
zh_hans: 前往 brew.sh

source: Granted
uk: Надано
zh_hans: 已授权

source: Greedy Updates
uk: Оновлення Greedy
zh_hans: Greedy 更新

source: Grid
uk: Сітка

# help.adopt.mismatch
source: If the installed bundle does not match the cask, CaskHub can offer Homebrew's version instead. Review that recovery action before accepting it.
uk: Якщо встановлений пакет програми не відповідає пакету Cask, CaskHub може запропонувати версію Homebrew. Перегляньте цю дію відновлення, перш ніж погодитися.

# help.adopt.packageInstallers
source: Apps installed from a package may need Homebrew's installer to run again. CaskHub explains this and asks before continuing.
uk: Для програм, установлених із пакета, може знадобитися повторний запуск інсталятора Homebrew. CaskHub пояснить це й запитає підтвердження перед продовженням.

# help.adopt.whatChanges
source: CaskHub asks Homebrew to create its management records for the existing app. Your documents, accounts, and app preferences stay in their normal locations.
uk: CaskHub просить Homebrew створити записи керування для наявної програми. Ваші документи, облікові записи та параметри програми залишаться у звичних місцях.

# help.adoption.subtitle
source: Adoption brings a compatible app installed outside Homebrew under Homebrew management.
uk: Додавання під керування передає сумісну програму, встановлену поза Homebrew, під керування Homebrew.
zh_hans: 接管可将 Homebrew 之外安装的兼容应用纳入 Homebrew 管理。

# help.browse.overview
source: Explore featured apps, top charts, recent releases, and categories. Browsing does not require Homebrew to be installed.
uk: Ознайомтеся з рекомендованими програмами, рейтингами, останніми випусками та категоріями. Для перегляду не потрібне встановлення Homebrew.

# help.gettingStarted.subtitle
source: Browse the Homebrew catalog freely, then use your local Homebrew installation to manage apps.
uk: Вільно переглядайте каталог Homebrew, а потім керуйте програмами за допомогою локальної інсталяції Homebrew.
zh_hans: 自由浏览 Homebrew 目录，然后使用本机安装的 Homebrew 管理应用。

# help.homebrew.customLocation
source: If Homebrew lives outside /opt/homebrew or /usr/local, choose its binary or installation folder in CaskHub Settings.
uk: Якщо Homebrew розташовано поза /opt/homebrew або /usr/local, виберіть його виконуваний файл або папку встановлення в параметрах CaskHub.

# help.homebrew.install
source: Install Homebrew from its official website, return to CaskHub, and the app will detect it automatically.
uk: Встановіть Homebrew з офіційного вебсайту й поверніться до CaskHub — програма виявить його автоматично.

# help.homebrew.subtitle
source: Homebrew is only required when CaskHub needs to install, update, adopt, repair, or uninstall an app.
uk: Homebrew потрібен лише тоді, коли CaskHub має встановити, оновити, додати під керування, відновити або видалити програму.
zh_hans: 仅当 CaskHub 需要安装、更新、接管、修复或卸载应用时才需要 Homebrew。

# help.install.howTo
source: Choose Install on any catalog card. CaskHub shows live progress and lets you cancel downloads while Homebrew supports cancellation safely.
uk: Натисніть «Встановити» на будь-якій картці каталогу. CaskHub показує перебіг операції та дає змогу скасувати завантаження, коли Homebrew може зробити це безпечно.

# help.installAndUpdate.subtitle
source: CaskHub runs operations through your real brew binary, so the same apps remain manageable from Terminal.
uk: CaskHub виконує операції через справжній виконуваний файл brew, тож тими самими програмами можна й надалі керувати з Терміналу.
zh_hans: CaskHub 通过本机的 brew 可执行文件执行操作，因此这些应用仍可在终端中管理。

# help.manage.overview
source: Install new apps, update Homebrew-managed apps, or adopt compatible apps already installed on your Mac.
uk: Встановлюйте нові програми, оновлюйте програми під керуванням Homebrew або додавайте під керування сумісні програми, уже встановлені на Mac.

# help.permissions.grant
source: Open System Settings → Privacy & Security → App Management, then enable CaskHub. Return to CaskHub afterward; a pending adoption can resume automatically.
uk: Відкрийте «Системні параметри» → «Конфіденційність і безпека» → «Керування програмами» й увімкніть CaskHub. Потім поверніться до CaskHub — очікуване додавання під керування може відновитися автоматично.

# help.permissions.subtitle
source: macOS may require permission before CaskHub can modify an application installed in /Applications.
uk: macOS може вимагати дозволу, перш ніж CaskHub зможе змінити програму, встановлену в /Applications.
zh_hans: 在 CaskHub 修改安装于 /Applications 的应用之前，macOS 可能要求授权。

# help.permissions.why
source: Some adoption and update operations need to replace or modify another app's bundle. macOS protects those changes with App Management permission.
uk: Деякі операції додавання під керування й оновлення мають замінити або змінити пакет іншої програми. macOS захищає такі зміни дозволом «Керування програмами».

# help.troubleshooting.homebrewMissing
source: Confirm Homebrew is installed. If it uses a custom prefix, select that location in Homebrew Settings.
uk: Переконайтеся, що Homebrew встановлено. Якщо використовується власний префікс, виберіть це розташування в параметрах Homebrew.

# help.troubleshooting.permissionDenied
source: Grant App Management permission and retry. CaskHub only requests this when an operation may modify another app bundle.
uk: Надайте дозвіл «Керування програмами» й повторіть спробу. CaskHub запитує його лише тоді, коли операція може змінити пакет іншої програми.

# help.troubleshooting.recovery
source: Interrupted or mismatched installations can expose Repair & Reinstall or Replace with Homebrew Version. These actions appear only when they match the detected failure.
uk: Для перерваних або невідповідних інсталяцій можуть з’явитися дії «Відновити й перевстановити» або «Замінити версією Homebrew». Вони доступні лише тоді, коли відповідають виявленій помилці.

# help.troubleshooting.subtitle
source: Start with the recovery action CaskHub presents for the affected app.
uk: Почніть із дії відновлення, яку CaskHub пропонує для відповідної програми.
zh_hans: 请先尝试 CaskHub 为受影响应用提供的恢复操作。

# help.updates.greedy
source: Enable Greedy to include casks that normally update themselves. Leave it off when you prefer each app's built-in updater.
uk: Увімкніть Greedy, щоб додати пакети Cask, які зазвичай оновлюються самостійно. Не вмикайте, якщо надаєте перевагу вбудованому засобу оновлення кожної програми.

# help.updates.overview
source: The Updates page lists Homebrew-managed apps with meaningful updates. Update All asks for confirmation before starting the batch.
uk: На сторінці «Оновлення» перелічено програми під керуванням Homebrew, для яких є суттєві оновлення. Перед пакетним оновленням дія «Оновити все» запитує підтвердження.

source: Homebrew could not extract this disk image because its layout is read-only. Try again once; if it repeats, the cask needs to be corrected upstream.
uk: Homebrew не вдалося розпакувати цей образ диска, оскільки його структура доступна лише для читання. Спробуйте ще раз. Якщо помилка повториться, пакет Cask потрібно виправити у вихідному репозиторії.
zh_hans: Homebrew 无法提取此磁盘映像，因为其布局为只读。请重试一次；如果问题再次出现，则需要由上游修正该 Cask。

source: Homebrew could not prepare its Portable Ruby runtime. Check access to GitHub and GHCR, then update Homebrew and try again.
uk: Homebrew не вдалося підготувати середовище виконання Portable Ruby. Перевірте доступ до GitHub і GHCR, потім оновіть Homebrew і повторіть спробу.
zh_hans: Homebrew 无法准备 Portable Ruby 运行环境。请检查能否访问 GitHub 和 GHCR，然后更新 Homebrew 并重试。
